'''
Реализовать консольное приложение заметки, с сохранением, чтением, добавлением, редактированием и удалением заметок.
Заметка должна содержать
 - идентификатор,
 - заголовок,
 - тело заметки
 - дату/время создания или последнего изменения заметки.

 Сохранение заметок необходимо сделать в формате json или csv формат (разделение полей рекомендуется делать через
 точку с запятой).7

 Реализацию пользовательского интерфейса студент может делать как ему удобнее, можно делать как
 параметры запуска программы (команда, данные), можно делать как запрос команды с консоли и последующим вводом данных,
 как-то ещё, на усмотрение студента.

Приложение должно запускаться без ошибок, должно уметь:
  - сохранять данные в файл,
  - уметь читать данные из файла,
  - делать выборку по дате,
  - выводить на экран выбранную запись,
  - выводить на экран весь список записок, При чтении списка заметок реализовать фильтрацию по дате.
  - добавлять записку,
  - редактировать ее
  - удалять.



'''

import controller

if __name__ == '__main__':
    controller.main_process()